package biz.shengweiexam;

/**
 * Created by IDEA
 * User:    tiztm
 * Date:    2016/10/21.
 */
public class SplitDept2 {

    public static final String newDeptNames = "南京市级机关 A1\n" +
            "南京市玄武区A101\n" +
            "南京市秦淮区A102\n" +
            "南京市建邺区A103\n" +
            "南京市鼓楼区A104\n" +
            "南京市栖霞区A105\n" +
            "南京市雨花台区A106\n" +
            "南京市江宁区A107\n" +
            "南京市浦口区A108\n" +
            "南京市六合区A109\n" +
            "南京市溧水区A110\n" +
            "南京市高淳区A111\n" +
            
            "无锡市级机关B1\n" +
            "江阴市B101\n" +
            "宜兴市B102\n" +
            "无锡市锡山区B103\n" +
            "无锡市惠山区B104\n" +
            "无锡市滨湖区B105\n" +
            "无锡市梁溪区B106\n" +
            "无锡市新吴区B107\n" +
            
            "徐州市级机关C1\n" +
            "丰县C101\n" +
            "沛县C102\n" +
            "睢宁县C103\n" +
            "邳州市C104\n" +
            "新沂市C105\n" +
            "徐州市铜山区C106\n" +
            "徐州市贾汪区C107\n" +
            "徐州市鼓楼区C108\n" +
            "徐州市云龙区C109\n" +
            "徐州市泉山区C110\n" +
            
            "常州市级机关D1\n" +
            "常州市金坛区D101\n" +
            "溧阳市D102\n" +
            "常州市武进区D103\n" +
            "常州市新北区D104\n" +
            "常州市天宁区D105\n" +
            "常州市钟楼区D106\n" +
            
            "苏州市级机关E1\n" +
            "张家港市E101\n" +
            "常熟市E102\n" +
            "太仓市E103\n" +
            "昆山市E104\n" +
            "苏州市吴江区E105\n" +
            "苏州市吴中区E106\n" +
            "苏州市相城区E107\n" +
            "苏州市姑苏区E108\n" +
            "苏州市虎丘区E109\n" +
            
            "南通市级机关F1\n" +
            "海安县F101\n" +
            "如皋市F102\n" +
            "如东县F103\n" +
            "海门市F104\n" +
            "南通市启东市F105\n" +
            "南通市崇川区F106\n" +
            "南通市通州区F107\n" +
            "南通市港闸区F108\n" +
            
            "连云港市级机关G1\n" +
            "东海县G101\n" +
            "灌云县G102\n" +
            "灌南县G103\n" +
            "连云港市赣榆区G104\n" +
            "连云港市海州区G105\n" +
            "连云港市连云区G106\n" +
            
            "淮安市级机关H1\n" +
            "洪泽县H101\n" +
            "涟水县H102\n" +
            "金湖县H103\n" +
            "盱眙县H104\n" +
            "淮安市清河区H105\n" +
            "淮安市清浦区H106\n" +
            "淮安市淮安区H107\n" +
            "淮安市淮阴区H108\n" +
            
            "盐城市级机关J1\n" +
            "东台市J101\n" +
            "盐城市大丰区J102\n" +
            "射阳县J103\n" +
            "建湖县J104\n" +
            "阜宁县J105\n" +
            "滨海县J106\n" +
            "响水县J107\n" +
            "盐城市盐都区J108\n" +
            "盐城市亭湖区J109\n" +
            
            "扬州市级机关K1\n" +
            "宝应县K101\n" +
            "高邮市K102\n" +
            "仪征市K103\n" +
            "扬州市江都区K104\n" +
            "扬州市邗江区K105\n" +
            "扬州市广陵区K106\n" +
            
            "镇江市级机关L1\n" +
            "丹阳市L101\n" +
            "句容市L102\n" +
            "扬中市L103\n" +
            "镇江市丹徒区L104\n" +
            "镇江市京口区L105\n" +
            "镇江市润州区L106\n" +
            
            "泰州市级机关M1\n" +
            "靖江市M101\n" +
            "泰兴市M102\n" +
            "兴化市M103\n" +
            "泰州市海陵区M104\n" +
            "泰州市高港区M105\n" +
            "泰州市姜堰区M106\n" +
            
            "宿迁市级机关N1\n" +
            "沭阳县N101\n" +
            "泗阳县N102\n" +
            "泗洪县N103\n" +
            "宿迁市宿豫区N104\n" +
            "宿迁市宿城区N105";

    static String[] words = {"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"};
    public static void main(String[] args) {
        String[] split = newDeptNames.split("\n");
        for (int i = 0; i < split.length; i++) {
            String spName = split[i];
//
//            for (int j = 0; j < 26; j++) {
//                String[] split1 = spName.split(words[j]);
//                if(split1.length<2) continue;
//                System.out.println(split1[0].trim()+","+words[j]+split1[1]);
//                break;
//            }

            System.out.println(i+":"+spName);
        }


    }

    public static void pringAZ() {
        char AName = 'A';
        for (int i = 0; i < 26; i++) {
            System.out.print("\"" +(char)(AName+i)+
                            "\",");

        }
    }

}
